#### EquipmentClassification Enumeration

---

|  |
| --- |
| See Also |

This enumeration is used to classify the mechanical equipment.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public enum EquipmentClassification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration EquipmentClassification ``` |

| Visual C++ |
| --- |
| ``` public enum class EquipmentClassification ``` |

# Members

| Member name | Description |
| --- | --- |
| None | The undefined equipment type. |
| Pump | The pump equipment. |

# See Also

Autodesk.Revit.DB.Mechanical Namespace